ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/src/MDR32FxQI_timer.c
/**
  ******************************************************************************
  * @file    MDR32FxQI_timer.c
  * @author  Milandr Application Team
  * @version V2.0.2i
  * @date    17/03/2022
  * @brief   This file contains all the TIMER firmware functions.
  ******************************************************************************
  * <br><br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, MILANDR SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
  * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2022 Milandr</center></h2>
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "MDR32FxQI_timer.h"

/** @addtogroup __MDR32FxQI_StdPeriph_Driver MDR32FxQI Standard Peripherial Driver
  * @{
  */

/** @defgroup TIMER TIMER
  * @{
  */

/** @defgroup TIMER_Private_Defines TIMER Private Defines
  * @{
  */

#if ((defined (USE_MDR32F9Q2I)) || (defined (USE_MDR32FG16S1QI)))
    #define IS_TIMER_ALL_PERIPH(PERIPH) (((PERIPH) == MDR_TIMER1) || \
                                         ((PERIPH) == MDR_TIMER2) || \
                                         ((PERIPH) == MDR_TIMER3))
#elif defined (USE_MDR32F1QI)
    #define IS_TIMER_ALL_PERIPH(PERIPH) (((PERIPH) == MDR_TIMER1) || \
                                         ((PERIPH) == MDR_TIMER2) || \
                                         ((PERIPH) == MDR_TIMER3) || \
                                         ((PERIPH) == MDR_TIMER4))
#endif

/** @} */ /* End of group TIMER_Private_Defines */

/** @defgroup TIMER_Private_Functions TIMER Private Functions
  * @{
  */

/**
  * @brief  Deinitializes the TIMERx peripheral registers to their default reset values.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @retval None
  */
void TIMER_DeInit(MDR_TIMER_TypeDef* TIMERx)
{
    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    TIMERx->CNTRL = 0;
    TIMERx->CNT   = 0;
    TIMERx->PSG   = 0;
    TIMERx->ARR   = 0;

    TIMERx->CH1_CNTRL  = 0;
    TIMERx->CH2_CNTRL  = 0;
    TIMERx->CH3_CNTRL  = 0;
    TIMERx->CH4_CNTRL  = 0;
    TIMERx->CH1_CNTRL1 = 0;
    TIMERx->CH2_CNTRL1 = 0;
    TIMERx->CH3_CNTRL1 = 0;
    TIMERx->CH4_CNTRL1 = 0;
    TIMERx->CH1_CNTRL2 = 0;
    TIMERx->CH2_CNTRL2 = 0;
    TIMERx->CH3_CNTRL2 = 0;
    TIMERx->CH4_CNTRL2 = 0;

    TIMERx->CCR1         = 0;
    TIMERx->CCR2         = 0;
    TIMERx->CCR3         = 0;
    TIMERx->CCR4         = 0;
    TIMERx->CCR11        = 0;
    TIMERx->CCR21        = 0;
    TIMERx->CCR31        = 0;
    TIMERx->CCR41        = 0;
    TIMERx->CH1_DTG      = 0;
    TIMERx->CH2_DTG      = 0;
    TIMERx->CH3_DTG      = 0;
    TIMERx->CH4_DTG      = 0;
    TIMERx->BRKETR_CNTRL = 0;
    TIMERx->STATUS       = 0;
    TIMERx->IE           = 0;
    TIMERx->DMA_RE       = 0;
#if defined (USE_MDR32F1QI)
    TIMERx->DMA_REChx[0] = TIMERx->DMA_REChx[1] =
            TIMERx->DMA_REChx[2] = TIMERx->DMA_REChx[3] = 0;
#endif /* #if  defined (USE_MDR32F1QI) */
}

/**
  * @brief  Initializes the TIMERx Counter peripheral according to
  *         the specified parameters in the TIMER_CntInitStruct.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @param  TIMER_CntInitStruct: pointer to a @ref TIMER_CntInitTypeDef structure
  *         that contains the configuration information for the specified TIMER peripheral.
  * @retval None
  */
void TIMER_CntInit(MDR_TIMER_TypeDef* TIMERx, const TIMER_CntInitTypeDef* TIMER_CntInitStruct)
{
    uint32_t tmpreg_CNTRL;
    uint32_t tmpreg_BRKETR_CNTRL;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_COUNTER_MODE(TIMER_CntInitStruct->TIMER_CounterMode));
    assert_param(IS_TIMER_COUNTER_DIR(TIMER_CntInitStruct->TIMER_CounterDirection));
    assert_param(IS_TIMER_EVENT_SOURCE(TIMER_CntInitStruct->TIMER_EventSource));
    assert_param(IS_TIMER_FILTER_SAMPLING(TIMER_CntInitStruct->TIMER_FilterSampling));
    assert_param(IS_TIMER_ARR_UPDATE_MODE(TIMER_CntInitStruct->TIMER_ARR_UpdateMode));
    assert_param(IS_TIMER_FILTER_CONF(TIMER_CntInitStruct->TIMER_ETR_FilterConf));
    assert_param(IS_TIMER_ETR_PRESCALER(TIMER_CntInitStruct->TIMER_ETR_Prescaler));
    assert_param(IS_TIMER_ETR_POLARITY(TIMER_CntInitStruct->TIMER_ETR_Polarity));
    assert_param(IS_TIMER_BRK_POLARITY(TIMER_CntInitStruct->TIMER_BRK_Polarity));

    TIMERx->CNT = TIMER_CntInitStruct->TIMER_IniCounter;
    TIMERx->PSG = TIMER_CntInitStruct->TIMER_Prescaler;
    TIMERx->ARR = TIMER_CntInitStruct->TIMER_Period;

    /* Form new value for the TIMERx_CNTRL register */
    tmpreg_CNTRL = TIMER_CntInitStruct->TIMER_CounterMode
                 + TIMER_CntInitStruct->TIMER_CounterDirection
                 + TIMER_CntInitStruct->TIMER_EventSource
                 + TIMER_CntInitStruct->TIMER_FilterSampling
                 + TIMER_CntInitStruct->TIMER_ARR_UpdateMode;

    /* Configure TIMERx_CNTRL register with new value */
    TIMERx->CNTRL = tmpreg_CNTRL;

    /* Form new value for the TIMERx_BRKETR_CNTRL register */
    tmpreg_BRKETR_CNTRL = (TIMER_CntInitStruct->TIMER_ETR_FilterConf << TIMER_BRKETR_CNTRL_ETR_FILTER_Pos)
                         + TIMER_CntInitStruct->TIMER_ETR_Prescaler
                         + TIMER_CntInitStruct->TIMER_ETR_Polarity
                         + TIMER_CntInitStruct->TIMER_BRK_Polarity;

    /* Configure TIMERx_BRKETR_CNTRL register with new value */
    TIMERx->BRKETR_CNTRL = tmpreg_BRKETR_CNTRL;
}

/**
  * @brief  Fills each TIMER_CntInitStruct member with its default value.
  * @param  TIMER_CntInitStruct: pointer to a @ref TIMER_CntInitTypeDef structure
  *         which will be initialized.
  * @retval None
  */
void TIMER_CntStructInit(TIMER_CntInitTypeDef* TIMER_CntInitStruct)
{
    TIMER_CntInitStruct->TIMER_IniCounter       = 0;
    TIMER_CntInitStruct->TIMER_Prescaler        = 0;
    TIMER_CntInitStruct->TIMER_Period           = 0;
    TIMER_CntInitStruct->TIMER_CounterMode      = TIMER_CntMode_ClkFixedDir;
    TIMER_CntInitStruct->TIMER_CounterDirection = TIMER_CntDir_Up;
    TIMER_CntInitStruct->TIMER_EventSource      = TIMER_EvSrc_TIM_CLK;
    TIMER_CntInitStruct->TIMER_FilterSampling   = TIMER_FDTS_TIMER_CLK_div_1;
    TIMER_CntInitStruct->TIMER_ARR_UpdateMode   = TIMER_ARR_Update_Immediately;
    TIMER_CntInitStruct->TIMER_ETR_FilterConf   = TIMER_Filter_1FF_at_TIMER_CLK;
    TIMER_CntInitStruct->TIMER_ETR_Prescaler    = TIMER_ETR_Prescaler_None;
    TIMER_CntInitStruct->TIMER_ETR_Polarity     = TIMER_ETRPolarity_NonInverted;
    TIMER_CntInitStruct->TIMER_BRK_Polarity     = TIMER_BRKPolarity_NonInverted;
}

/**
  * @brief  Enables or disables the specified TIMER peripheral.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @param  NewState - @ref FunctionalState - new state of the TIMERx peripheral
  * @retval None
  */
void TIMER_Cmd(MDR_TIMER_TypeDef* TIMERx, FunctionalState NewState)
{
    uint32_t tmpreg_CNTRL;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    tmpreg_CNTRL = TIMERx->CNTRL;

    /* Form new value */
    if (NewState != DISABLE)
    {
        /* Enable TIMERx by setting the CNT_EN bit in the CNTRL register */
        tmpreg_CNTRL |= TIMER_CNTRL_CNT_EN;
    }
    else
    {
        /* Disable TIMERx by resetting the CNT_EN bit in the CNTRL register */
        tmpreg_CNTRL &= ~TIMER_CNTRL_CNT_EN;
    }

    /* Configure CNTRL register with new value */
    TIMERx->CNTRL = tmpreg_CNTRL;
}

/**
  * @brief  Sets the TIMERx Counter Register value.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @param  Counter: specifies the Counter register new value.
  * @retval None
  */
#if defined (USE_MDR32F1QI)
void TIMER_SetCounter(MDR_TIMER_TypeDef* TIMERx, uint32_t Counter)
#elif defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
void TIMER_SetCounter(MDR_TIMER_TypeDef* TIMERx, uint16_t Counter)
#endif
{
    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    TIMERx->CNT = Counter;
}

/**
  * @brief  Returns the TIMERx Counter value.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @retval Counter Register value.
  */
#if defined (USE_MDR32F1QI)
uint32_t TIMER_GetCounter(MDR_TIMER_TypeDef* TIMERx)
#elif defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
uint16_t TIMER_GetCounter(MDR_TIMER_TypeDef* TIMERx)
#endif
{
    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    return TIMERx->CNT;
}


/**
  * @brief  Sets the TIMERx Prescaler.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @param  Prescaler: specifies the Prescaler Register value.
  * @retval None
  */
void TIMER_SetCntPrescaler(MDR_TIMER_TypeDef* TIMERx, uint16_t Prescaler)
{
    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    TIMERx->PSG = Prescaler;
}

/**
  * @brief  Gets the TIMERx Prescaler.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @retval Prescaler Register value
  */
uint16_t TIMER_GetCntPrescaler(MDR_TIMER_TypeDef* TIMERx)
{
    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    return (TIMERx->PSG);
}

/**
  * @brief  Sets the TIMERx Autoreload Register value.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @param  Autoreload: specifies the Autoreload Register value.
  * @retval None
  */
#if defined (USE_MDR32F1QI)
void TIMER_SetCntAutoreload(MDR_TIMER_TypeDef* TIMERx, uint32_t Autoreload)
#elif defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
void TIMER_SetCntAutoreload(MDR_TIMER_TypeDef* TIMERx, uint16_t Autoreload)
#endif
{
    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

