ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/src/MDR32FxQI_timer.c
    *tmpreg_CH_CNTRL1x = tmpreg_CH_CNTRL1;
}

/**
  * @brief  Configures the TIMERx Channel Output source.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @param  Channel - @ref TIMER_Channel_Number_TypeDef - specifies the Timer Channel number.
  * @param  OutSource - @ref TIMER_CH_OUT_Src_TypeDef - specifies the Channel Output source.
  * @retval None
  */
void TIMER_ChnOutSourceConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_Channel_Number_TypeDef Channel, TIMER_CH_OUT_Src_TypeDef OutSource)
{
    __IO uint32_t *tmpreg_CH_CNTRL1x;
    uint32_t tmpreg_CH_CNTRL1;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHO_SOURCE(OutSource));

    tmpreg_CH_CNTRL1x = &TIMERx->CH1_CNTRL1 + (uint32_t)Channel;

    tmpreg_CH_CNTRL1 = *tmpreg_CH_CNTRL1x;
    tmpreg_CH_CNTRL1 &= ~TIMER_CH_CNTRL1_SELO_Msk;
    tmpreg_CH_CNTRL1 += (uint32_t)OutSource << TIMER_CH_CNTRL1_SELO_Pos;
    *tmpreg_CH_CNTRL1x = tmpreg_CH_CNTRL1;
}

/**
  * @brief  Configures the TIMERx Channel Output mode.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @param  Channel - @ref TIMER_Channel_Number_TypeDef - specifies the Timer Channel number.
  * @param  Mode - @ref TIMER_CH_OUT_Mode_TypeDef - specifies the Channel Output Enable source.
  * @retval None
  */
void TIMER_ChnOutModeConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_Channel_Number_TypeDef Channel, TIMER_CH_OUT_Mode_TypeDef Mode)
{
    __IO uint32_t *tmpreg_CH_CNTRL1x;
    uint32_t tmpreg_CH_CNTRL1;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHO_MODE(Mode));

    tmpreg_CH_CNTRL1x = &TIMERx->CH1_CNTRL1 + (uint32_t)Channel;

    tmpreg_CH_CNTRL1 = *tmpreg_CH_CNTRL1x;
    tmpreg_CH_CNTRL1 &= ~TIMER_CH_CNTRL1_SELOE_Msk;
    tmpreg_CH_CNTRL1 += (uint32_t)Mode << TIMER_CH_CNTRL1_SELOE_Pos;
    *tmpreg_CH_CNTRL1x = tmpreg_CH_CNTRL1;
}

/**
  * @brief  Configures the TIMERx Channel Output polarity.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @param  Channel - @ref TIMER_Channel_Number_TypeDef - specifies the Timer Channel number.
  * @param  Polarity - @ref TIMER_CH_OUT_Polarity_TypeDef - enables or disables the Channel Output inversion.
  * @retval None
  */
void TIMER_ChnOutPolarityConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_Channel_Number_TypeDef Channel, TIMER_CH_OUT_Polarity_TypeDef Polarity)
{
    __IO uint32_t *tmpreg_CH_CNTRL1x;
    uint32_t tmpreg_CH_CNTRL1;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHO_POLARITY(Polarity));

    tmpreg_CH_CNTRL1x = &TIMERx->CH1_CNTRL1 + (uint32_t)Channel;

    tmpreg_CH_CNTRL1 = *tmpreg_CH_CNTRL1x;
    tmpreg_CH_CNTRL1 &= ~TIMER_CH_CNTRL1_INV;
    tmpreg_CH_CNTRL1 += (uint32_t)Polarity << TIMER_CH_CNTRL1_INV_Pos;
    *tmpreg_CH_CNTRL1x = tmpreg_CH_CNTRL1;
}

/**
  * @brief  Configures the TIMERx NChannel output.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @param  Channel - @ref TIMER_Channel_Number_TypeDef - specifies the Timer Channel number.
  * @param  OutSource - @ref TIMER_CH_OUT_Src_TypeDef - specifies the NChannel Output source.
  * @param  Mode - @ref TIMER_CH_OUT_Mode_TypeDef - specifies the NChannel Output Enable source.
  * @param  Polarity - @ref TIMER_CH_OUT_Polarity_TypeDef - enables or disables the NChannel Output inversion.
  * @retval None
  */
void TIMER_ChnNOutConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_Channel_Number_TypeDef Channel, TIMER_CH_OUT_Src_TypeDef OutSource, TIMER_CH_OUT_Mode_TypeDef Mode, TIMER_CH_OUT_Polarity_TypeDef Polarity)
{
    __IO uint32_t *tmpreg_CH_CNTRL1x;
    uint32_t tmpreg_CH_CNTRL1;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHO_SOURCE(OutSource));
    assert_param(IS_TIMER_CHO_MODE(Mode));
    assert_param(IS_TIMER_CHO_POLARITY(Polarity));

    tmpreg_CH_CNTRL1x = &TIMERx->CH1_CNTRL1 + (uint32_t)Channel;

    tmpreg_CH_CNTRL1 = *tmpreg_CH_CNTRL1x;
    tmpreg_CH_CNTRL1 &= ~(TIMER_CH_CNTRL1_NINV + TIMER_CH_CNTRL1_NSELO_Msk + TIMER_CH_CNTRL1_NSELOE_Msk);
    tmpreg_CH_CNTRL1 += ((uint32_t)Polarity  << TIMER_CH_CNTRL1_NINV_Pos)
                      + ((uint32_t)OutSource << TIMER_CH_CNTRL1_NSELO_Pos)
                      + ((uint32_t)Mode      << TIMER_CH_CNTRL1_NSELOE_Pos);
    *tmpreg_CH_CNTRL1x = tmpreg_CH_CNTRL1;
}

/**
  * @brief  Configures the TIMERx NChannel Output source.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @param  Channel - @ref TIMER_Channel_Number_TypeDef - specifies the Timer Channel number.
  * @param  OutSource - @ref TIMER_CH_OUT_Src_TypeDef - specifies the NChannel Output source.
  * @retval None
  */
void TIMER_ChnNOutSourceConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_Channel_Number_TypeDef Channel, TIMER_CH_OUT_Src_TypeDef OutSource)
{
    __IO uint32_t *tmpreg_CH_CNTRL1x;
    uint32_t tmpreg_CH_CNTRL1;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHO_SOURCE(OutSource));

    tmpreg_CH_CNTRL1x = &TIMERx->CH1_CNTRL1 + (uint32_t)Channel;

    tmpreg_CH_CNTRL1 = *tmpreg_CH_CNTRL1x;
    tmpreg_CH_CNTRL1 &= ~TIMER_CH_CNTRL1_NSELO_Msk;
    tmpreg_CH_CNTRL1 += (uint32_t)OutSource << TIMER_CH_CNTRL1_NSELO_Pos;
    *tmpreg_CH_CNTRL1x = tmpreg_CH_CNTRL1;
}

/**
  * @brief  Configures the TIMERx NChannel Output mode.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @param  Channel - @ref TIMER_Channel_Number_TypeDef - specifies the Timer Channel number.
  * @param  Mode - @ref TIMER_CH_OUT_Mode_TypeDef - specifies the NChannel Output Enable source.
  * @retval None
  */
void TIMER_ChnNOutModeConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_Channel_Number_TypeDef Channel, TIMER_CH_OUT_Mode_TypeDef Mode)
{
    __IO uint32_t *tmpreg_CH_CNTRL1x;
    uint32_t tmpreg_CH_CNTRL1;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHO_MODE(Mode));

    tmpreg_CH_CNTRL1x = &TIMERx->CH1_CNTRL1 + (uint32_t)Channel;

    tmpreg_CH_CNTRL1 = *tmpreg_CH_CNTRL1x;
    tmpreg_CH_CNTRL1 &= ~TIMER_CH_CNTRL1_NSELOE_Msk;
    tmpreg_CH_CNTRL1 += (uint32_t)Mode << TIMER_CH_CNTRL1_NSELOE_Pos;
    *tmpreg_CH_CNTRL1x = tmpreg_CH_CNTRL1;
}

/**
  * @brief  Configures the TIMERx NChannel Output polarity.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @param  Channel - @ref TIMER_Channel_Number_TypeDef - specifies the Timer Channel number.
  * @param  Polarity - @ref TIMER_CH_OUT_Polarity_TypeDef - enables or disables the NChannel Output inversion.
  * @retval None
  */
void TIMER_ChnNOutPolarityConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_Channel_Number_TypeDef Channel, TIMER_CH_OUT_Polarity_TypeDef Polarity)
{
    __IO uint32_t *tmpreg_CH_CNTRL1x;
    uint32_t tmpreg_CH_CNTRL1;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHO_POLARITY(Polarity));

    tmpreg_CH_CNTRL1x = &TIMERx->CH1_CNTRL1 + Channel;

    tmpreg_CH_CNTRL1 = *tmpreg_CH_CNTRL1x;
    tmpreg_CH_CNTRL1 &= ~TIMER_CH_CNTRL1_NINV;
    tmpreg_CH_CNTRL1 += (uint32_t)Polarity << TIMER_CH_CNTRL1_NINV_Pos;
    *tmpreg_CH_CNTRL1x = tmpreg_CH_CNTRL1;
}

/**
  * @brief  Configures the TIMERx Dead Time Generator (DTG) peripheral.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @param  Channel - @ref TIMER_Channel_Number_TypeDef - specifies the Timer Channel number.
  * @param  MainPrescaler: specifies the Main Prescaler value.
  *         This parameter can be a number between 0x0000 and 0x00FF.
  * @param  AuxPrescaler: specifies the Auxiliary Prescaler value.
  *         This parameter can be a number between 0x0000 and 0x000F.
  * @param  ClockSource - @ref TIMER_CH_DTG_Clk_Src_TypeDef - specifies the DTG clock source.
  * @retval None
  */
void TIMER_ChnOutDTGConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_Channel_Number_TypeDef Channel, uint32_t MainPrescaler, uint32_t AuxPrescaler, TIMER_CH_DTG_Clk_Src_TypeDef ClockSource)
{
    uint32_t tmpreg_CH_DTG;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CHANNEL_NUMBER(Channel));
    assert_param(IS_TIMER_CHANNEL_DTG_MAIN_PRESCALER(MainPrescaler));
    assert_param(IS_TIMER_CHANNEL_DTG_AUX_PRESCALER(AuxPrescaler));
    assert_param(IS_TIMER_CHANNEL_DTG_CLK_SOURCE(ClockSource));

    tmpreg_CH_DTG = (MainPrescaler << TIMER_CH_DTG_Pos)
                  + (AuxPrescaler  << TIMER_CH_DTGX_Pos)
                  + (uint32_t)ClockSource;

