ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/src/MDR32FxQI_timer.c
    *(&TIMERx->CH1_DTG + (uint32_t)Channel) = tmpreg_CH_DTG;
}

/**
  * @brief  Returns the TIMERx Status Register value.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @retval The TIMERx_STATUS Register value.
  */
uint32_t TIMER_GetStatus(MDR_TIMER_TypeDef* TIMERx)
{
    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    return (TIMERx->STATUS);
}

/**
  * @brief  Checks whether the specified TIMERx Status flag is set or not.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @param  Flag - @ref TIMER_Status_Flags_TypeDef - specifies the flag to check.
  * @retval @ref FlagStatus - Current Status flag state (SET or RESET).
  */
FlagStatus TIMER_GetFlagStatus(MDR_TIMER_TypeDef* TIMERx, TIMER_Status_Flags_TypeDef Flag)
{
    FlagStatus bitstatus;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_STATUS_FLAG(Flag));

    if ((TIMERx->STATUS & Flag) == 0)
    {
        bitstatus = RESET;
    }
    else
    {
        bitstatus = SET;
    }

    return bitstatus;
}

/**
  * @brief  Clears the TIMERx's pending flags.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @param  Flags: specifies the flag bit mask to clear.
  *         This parameter can be any combination of @ref TIMER_Status_Flags_TypeDef values.
  * @retval None
  */
void TIMER_ClearFlag(MDR_TIMER_TypeDef* TIMERx, uint32_t Flags)
{
    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_STATUS(Flags));

    TIMERx->STATUS = ~Flags;
}

/**
  * @brief  Enables or disables the TIMERx's DMA Requests.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @param  TIMER_DMASource - @ref TIMER_Status_Flags_TypeDef - specifies the DMA Request sources.
  * @param  TIMER_DMAChannel - @ref TIMER_DMA_Channel_TypeDef - specifies the DMA channel.
  *         @note TIMER_DMAChannel available only for MDR32F1QI
  * @param  NewState - @ref FunctionalState - new state of the DMA Request sources.
  * @retval None
  */
#if defined (USE_MDR32F1QI)
void TIMER_DMACmd(MDR_TIMER_TypeDef* TIMERx, uint32_t TIMER_DMASource, TIMER_DMA_Channel_TypeDef TIMER_DMAChannel, FunctionalState NewState)
#endif
#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
void TIMER_DMACmd(MDR_TIMER_TypeDef* TIMERx, uint32_t TIMER_DMASource, FunctionalState NewState)
#endif
{
    uint32_t tmpreg_DMA_RE;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_STATUS(TIMER_DMASource));
    assert_param(IS_FUNCTIONAL_STATE(NewState));
#if defined (USE_MDR32F1QI)
    assert_param(IS_TIMER_DMA_Channel(TIMER_DMAChannel));

    if(TIMER_DMAChannel == TIMER_DMA_Channel0)
    {
#endif
        tmpreg_DMA_RE = TIMERx->DMA_RE;

        /* Form new value */
        if (NewState != DISABLE)
        {
            /* Enable TIMERx DMA Requests by setting bits in the DMA_RE register */
            tmpreg_DMA_RE |= TIMER_DMASource;
        }
        else
        {
            /* Disable TIMERx DMA Requests by clearing bits in the DMA_RE register */
            tmpreg_DMA_RE &= ~TIMER_DMASource;
        }

        /* Configure CNTRL register with new value */
        TIMERx->DMA_RE = tmpreg_DMA_RE;
#if defined (USE_MDR32F1QI)
    }
    else
    {
        tmpreg_DMA_RE = TIMERx->DMA_REChx[TIMER_DMAChannel];

        /* Form new value */
        if (NewState != DISABLE)
        {
            /* Enable TIMERx DMA Requests by setting bits in the DMA_RE register */
            tmpreg_DMA_RE |= TIMER_DMASource;
        }
        else
        {
            /* Disable TIMERx DMA Requests by clearing bits in the DMA_RE register */
            tmpreg_DMA_RE &= ~TIMER_DMASource;
        }

        /* Configure CNTRL register with new value */
        TIMERx->DMA_REChx[TIMER_DMAChannel] = tmpreg_DMA_RE;

    }
#endif
}

/**
  * @brief  Enables or disables the specified TIMER interrupts.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @param  TIMER_IT: specifies the TIMER interrupts sources to be enabled or disabled.
  *         This parameter can be any combination of @ref TIMER_Status_Flags_TypeDef values.
  * @param  NewState - @ref FunctionalState - new state of the TIMER interrupts.
  * @retval None
  */
void TIMER_ITConfig(MDR_TIMER_TypeDef* TIMERx, uint32_t TIMER_IT, FunctionalState NewState)
{
    uint32_t tmpreg_IE;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_STATUS(TIMER_IT));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    tmpreg_IE = TIMERx->IE;

    /* Form new value */
    if (NewState != DISABLE)
    {
        /* Enable the TIMERx Interrupt requests by setting bits in the IE register */
        tmpreg_IE |= TIMER_IT;
    }
    else
    {
        /* Disable the TIMERx Interrupt requests by clearing bits in the IE register */
        tmpreg_IE &= ~TIMER_IT;
    }

    /* Configure CNTRL register with new value */
    TIMERx->IE = tmpreg_IE;
}

/**
  * @brief  Checks whether the TIMERx interrupt has occurred or not.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @param  TIMER_IT - @ref TIMER_Status_Flags_TypeDef - specifies the TIMER interrupt source to check.
  * @retval @ref ITStatus - The state of the TIMER_IT (SET or RESET).
  */
ITStatus TIMER_GetITStatus(MDR_TIMER_TypeDef* TIMERx, TIMER_Status_Flags_TypeDef TIMER_IT)
{
    ITStatus bitstatus;
    uint32_t tmpreg;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_STATUS_FLAG(TIMER_IT));

    tmpreg = TIMERx->IE;
    tmpreg = TIMERx->STATUS & tmpreg & (uint32_t)TIMER_IT;

