ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/src/MDR32FxQI_timer.c
    if (tmpreg == 0)
    {
        bitstatus = RESET;
    }
    else
    {
        bitstatus = SET;
    }

    return bitstatus;
}

/**
  * @brief  Initializes the TIMERx peripheral Clock according to the
  *         specified parameters.
  * @param  TIMERx: select the TIMER peripheral.
  *         This parameter can be one of the MDR_TIMERx values, where x is a number:
  *             1, 2, 3 for MDR32F9Q2I and MDR32FG16S1QI;
  *             1, 2, 3, 4 for MDR32F1QI.
  * @param  TIMER_BRG - @ref TIMER_Clock_BRG_TypeDef - specifies the HCLK division factor.
  * @retval None
  */
void TIMER_BRGInit(MDR_TIMER_TypeDef* TIMERx, TIMER_Clock_BRG_TypeDef TIMER_BRG)
{
    uint32_t tmpreg;

    /* Check the parameters */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CLOCK_BRG(TIMER_BRG));

#if defined (USE_MDR32F1QI)
    if(TIMERx == MDR_TIMER4)
        tmpreg = MDR_RST_CLK->UART_CLOCK;
    else
#endif /* #if defined (USE_MDR32F1QI) */
        tmpreg = MDR_RST_CLK->TIM_CLOCK;

    if(TIMERx == MDR_TIMER1)
    {
        tmpreg &= ~RST_CLK_TIM_CLOCK_TIM1_BRG_Msk;
        tmpreg |= TIMER_BRG << RST_CLK_TIM_CLOCK_TIM1_BRG_Pos;
        tmpreg |= RST_CLK_TIM_CLOCK_TIM1_CLK_EN;
    }
    else if(TIMERx == MDR_TIMER2)
    {
        tmpreg &= ~RST_CLK_TIM_CLOCK_TIM2_BRG_Msk;
        tmpreg |= TIMER_BRG << RST_CLK_TIM_CLOCK_TIM2_BRG_Pos;
        tmpreg |= RST_CLK_TIM_CLOCK_TIM2_CLK_EN;
    }
    else if(TIMERx == MDR_TIMER3)
    {
        tmpreg &= ~RST_CLK_TIM_CLOCK_TIM3_BRG_Msk;
        tmpreg |= TIMER_BRG << RST_CLK_TIM_CLOCK_TIM3_BRG_Pos;
        tmpreg |= RST_CLK_TIM_CLOCK_TIM3_CLK_EN;
    }
#if defined (USE_MDR32F1QI)
    else if(TIMERx == MDR_TIMER4)
    {
        tmpreg &= ~RST_CLK_UART_CLOCK_TIM4_BRG_Msk;
        tmpreg |= TIMER_BRG << RST_CLK_UART_CLOCK_TIM4_BRG_Pos;
        tmpreg |= RST_CLK_UART_CLOCK_TIM4_CLK_EN;
    }

    if(TIMERx == MDR_TIMER4)
        MDR_RST_CLK->UART_CLOCK = tmpreg;
    else
#endif /* #if defined (USE_MDR32F1QI) */
        MDR_RST_CLK->TIM_CLOCK = tmpreg;
}

/** @} */ /* End of group TIMER_Private_Functions */

/** @} */ /* End of group TIMER */

/** @} */ /* End of group __MDR32FxQI_StdPeriph_Driver */

/*********************** (C) COPYRIGHT 2022 Milandr ****************************
*
* END OF FILE MDR32FxQI_timer.c */


